In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("house_price_mumbai.csv")

In [3]:
data.head()

,BHK,project,Location,City,Total sqft,price_sqft,price
0,3 BHK Apartment,SHREE KRISHNA SangamChembur,Chembur,Mumbai,984,"31,000",3.05 Cr
1,2 BHK Apartment,Ekdanta 24 KaratKurla,Kurla,Mumbai,598,"23,913",1.42 Cr
2,2 BHK Apartment,Liberty Bay VueMalad West,Malad West,Mumbai,738,"21,000",1.54 Cr
3,3 BHK Apartment,Thalia Vrindavan FloraRasayani,Rasayani,Mumbai,644,"10,676",68.75 L
4,2 BHK Apartment,Mayfair The ViewVikhroli,Vikhroli,Mumbai,582,"24,914",1.45 Cr

In [4]:
data.shape

(3980, 7)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3980 entries, 0 to 3979
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   BHK         3980 non-null   object
 1   project     3127 non-null   object
 2   Location    3980 non-null   object
 3   City        3980 non-null   object
 4   Total sqft  3980 non-null   int64
 5   price_sqft  3980 non-null   object
 6   price       3980 non-null   object
dtypes: int64(1), object(6)
memory usage: 217.8+ KB

In [6]:
for column in data.columns:
    print(data[column].value_counts())
    print("*"*20)

BHK
1 BHK Apartment            1322
2 BHK Apartment            1058
1                           477
3 BHK Apartment             387
2                           252
5 BHK Independent Floor     234
1 RK Studio Apartment        77
3                            76
R                            32
4 BHK Apartment              30
4                            13
1 BHK Independent House       3
5 BHK Apartment               3
3 BHK Independent House       3
5 BHK Independent House       2
3 BHK Villa                   2
2 BHK Independent Floor       2
5                             2
6                             1
6 BHK Independent Floor       1
2 RK Studio Apartment         1
3 BHK Independent Floor       1
2 BHK Independent House       1
Name: count, dtype: int64
********************
project
Reputed Builder Wild Wood Park 2Andheri West                           487
JP North BarcelonaMira Road East                                        61
Agarwal ParamountVirar                                                  40
Piramal Revanta Tower 1Mulund West                                      37
Ariisto Bellanza Phase 1 Wing A B C At The Prestige CityMulund West     30
                                                                      ...
Kohinoor CityKurla                                                       1
Shraddha Autumn ParkKanjurmarg                                           1
Dynamix AvanyaDahisar                                                    1
Shubh Seven Square AvenueBhayandar East                                  1
Navkar City Phase I Part 3Naigaon East                                   1
Name: count, Length: 967, dtype: int64
********************
Location
Andheri West                   526
Mira Road East                 285
Dombivali                      240
Virar                          186
Thane West                     150
                              ...
Vikhroli West                    1
Ranjanpada Uran Panvel Road      1
Matunga                          1
Deonar                           1
Hiranandani Estates              1
Name: count, Length: 174, dtype: int64
********************
City
Mumbai    3980
Name: count, dtype: int64
********************
Total sqft
651      238
1601     213
650      104
1000      98
600       87
        ...
1658       1
10000      1
9000       1
533        1
966        1
Name: count, Length: 753, dtype: int64
********************
price_sqft
3,072     236
1,249     213
6,000      29
4,000      28
4,100      27
         ...
11,960      1
18,260      1
5,940       1
14,081      1
5,245       1
Name: count, Length: 2164, dtype: int64
********************
price
20 L       499
65 L        47
95 L        45
90 L        43
60 L        39
          ...
3 L          1
18.29 L      1
12.5 Cr      1
23.5 Cr      1
55.34 L      1
Name: count, Length: 870, dtype: int64
********************

In [7]:
data.isna().sum()

BHK             0
project       853
Location        0
City            0
Total sqft      0
price_sqft      0
price           0
dtype: int64

In [8]:
data.drop(columns = ['project','City'],inplace = True)

In [9]:
data.head()

               BHK    Location  Total sqft price_sqft    price
0  3 BHK Apartment     Chembur         984     31,000  3.05 Cr
1  2 BHK Apartment       Kurla         598     23,913  1.42 Cr
2  2 BHK Apartment  Malad West         738     21,000  1.54 Cr
3  3 BHK Apartment    Rasayani         644     10,676  68.75 L
4  2 BHK Apartment    Vikhroli         582     24,914  1.45 Cr

In [10]:
data['price'] = data['price'].apply(lambda x: float(x.split('Cr')[0])*(10**7) if 'Cr' in x else float(x.split('L')[0])*(10**6) if 'L' in x else float(x))

In [11]:
data['price_sqft'] = pd.to_numeric(data['price_sqft'], errors='coerce')

In [12]:
print(data)

                  BHK      Location  Total sqft  price_sqft       price
0     3 BHK Apartment       Chembur         984         NaN  30500000.0
1     2 BHK Apartment         Kurla         598         NaN  14200000.0
2     2 BHK Apartment    Malad West         738         NaN  15400000.0
3     3 BHK Apartment      Rasayani         644         NaN  68750000.0
4     2 BHK Apartment      Vikhroli         582         NaN  14500000.0
...               ...           ...         ...         ...         ...
3975  2 BHK Apartment         Vasai         966         NaN  48000000.0
3976  1 BHK Apartment  Naigaon East         500         NaN  26000000.0
3977  1 BHK Apartment  Naigaon East         610         NaN  34000000.0
3978  1 BHK Apartment  Naigaon East         610         NaN  32000000.0
3979  1 BHK Apartment  Naigaon East         590         NaN  36000000.0

[3980 rows x 5 columns]

In [13]:
data.describe()

         Total sqft  price_sqft         price
count   3980.000000   28.000000  3.980000e+03
mean     895.417588  388.321429  3.754819e+07
std      688.831332  163.480218  2.625071e+07
min      127.000000  114.000000  1.250000e+06
25%      590.000000  299.250000  2.000000e+07
50%      717.000000  332.000000  2.800000e+07
75%     1060.000000  525.000000  5.250000e+07
max    16000.000000  734.000000  3.000000e+08

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3980 entries, 0 to 3979
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   BHK         3980 non-null   object
 1   Location    3980 non-null   object
 2   Total sqft  3980 non-null   int64
 3   price_sqft  28 non-null     float64
 4   price       3980 non-null   float64
dtypes: float64(2), int64(1), object(2)
memory usage: 155.6+ KB

In [15]:
data.drop(columns = ['price_sqft'],inplace = True)

In [16]:
data.describe()

         Total sqft         price
count   3980.000000  3.980000e+03
mean     895.417588  3.754819e+07
std      688.831332  2.625071e+07
min      127.000000  1.250000e+06
25%      590.000000  2.000000e+07
50%      717.000000  2.800000e+07
75%     1060.000000  5.250000e+07
max    16000.000000  3.000000e+08

In [17]:
data['price_per_sqft'] = data['price']/data['Total sqft']
print(data["price_per_sqft"])

0        30995.934959
1        23745.819398
2        20867.208672
3       106754.658385
4        24914.089347
            ...
3975     49689.440994
3976     52000.000000
3977     55737.704918
3978     52459.016393
3979     61016.949153
Name: price_per_sqft, Length: 3980, dtype: float64

In [18]:
data['BHK'] = data['BHK'].str.extract(r'(\d+)').astype(float)
print(data['BHK'])

0       3.0
1       2.0
2       2.0
3       3.0
4       2.0
       ...
3975    2.0
3976    1.0
3977    1.0
3978    1.0
3979    1.0
Name: BHK, Length: 3980, dtype: float64

In [19]:
data.dropna(inplace=True)

In [20]:
data.rename(columns={'Total sqft': 'Total_sqft'}, inplace=True)
data.head()

   BHK    Location  Total_sqft       price  price_per_sqft
0  3.0     Chembur         984  30500000.0    30995.934959
1  2.0       Kurla         598  14200000.0    23745.819398
2  2.0  Malad West         738  15400000.0    20867.208672
3  3.0    Rasayani         644  68750000.0   106754.658385
4  2.0    Vikhroli         582  14500000.0    24914.089347

In [21]:
#saving cleaned data
data.to_csv("final_dataset.csv")

In [22]:
#Splitting the dataset
X = data.drop(columns=['price'])
Y = data['price']

In [23]:
# importing required modules
from sklearn.preprocessing import StandardScaler, OneHotEncoder
from sklearn.model_selection import train_test_split
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_absolute_error, mean_squared_error, r2_score

In [24]:
X_train,X_test,Y_train,Y_test = train_test_split(X,Y,test_size=0.2, random_state=0)

In [25]:
print(X_train.shape)
print(Y_train.shape)

(3158, 4)
(3158,)

In [26]:
data.shape

(3948, 5)

In [27]:
# Applying Linear REgression

In [28]:
# Define the column transformer
preprocessor = ColumnTransformer(
    transformers=[
        ('location', OneHotEncoder(handle_unknown='ignore'), ['Location']),
        ('scaler', StandardScaler(), ['BHK', 'price_per_sqft', 'Total_sqft'])
    ],
    remainder='passthrough'
)

In [29]:
# Create a pipeline for Linear Regression
linear_pipeline = Pipeline(steps=[
    ('preprocessor', preprocessor),
    ('regressor', LinearRegression())
])

# Fit the model to the training data
linear_pipeline.fit(X_train, Y_train)

# Predict on the test data
linear_Y_pred = linear_pipeline.predict(X_test)

# Calculate evaluation metrics for Linear Regression
linear_r2 = r2_score(Y_test, linear_Y_pred)
linear_mae = mean_absolute_error(Y_test, linear_Y_pred)
linear_mse = mean_squared_error(Y_test, linear_Y_pred)
linear_rmse = np.sqrt(linear_mse)

# Print evaluation metrics for Linear Regression
print("Linear Regression:")
print(f'R-squared: {linear_r2}')
print(f'Mean Absolute Error: {linear_mae}')
print(f'Mean Squared Error: {linear_mse}')
print(f'Root Mean Squared Error: {linear_rmse}')

Linear Regression:
R-squared: 0.7504070888387353
Mean Absolute Error: 8620891.71580667
Mean Squared Error: 155202545553917.38
Root Mean Squared Error: 12458031.36751218

In [30]:
from sklearn.ensemble import RandomForestRegressor
from sklearn.pipeline import Pipeline

# Create a pipeline for Random Forest
rf_pipeline = Pipeline(steps=[
    ('preprocessor', preprocessor),
    ('regressor', RandomForestRegressor(n_estimators=100 ,random_state=42))
])

# Fit the model to the training data
rf_pipeline.fit(X_train, Y_train)

# Predict on the test data
rf_Y_pred = rf_pipeline.predict(X_test)

# Calculate evaluation metrics for Random Forest
rf_r2 = r2_score(Y_test, rf_Y_pred)
rf_mae = mean_absolute_error(Y_test, rf_Y_pred)
rf_mse = mean_squared_error(Y_test, rf_Y_pred)
rf_rmse = np.sqrt(rf_mse)

# Print evaluation metrics for Random Forest
print("\nRandom Forest:")
print(f'R-squared: {rf_r2}')
print(f'Mean Absolute Error: {rf_mae}')
print(f'Mean Squared Error: {rf_mse}')
print(f'Root Mean Squared Error: {rf_rmse}')

Random Forest:
R-squared: 0.9949242620793741
Mean Absolute Error: 599614.8101265823
Mean Squared Error: 3156209213556.962
Root Mean Squared Error: 1776572.321510431

In [31]:
import pickle
with open('model/random_forest_pipeline.pkl', 'wb') as file:
    pickle.dump(rf_pipeline, file)

In [32]:
import sklearn
print(sklearn.__version__)

1.5.0

In [35]:
print(data['Total_sqft'].min())
print(data['Total_sqft'].max())

127
12600

In [36]:
print(data['Location'].unique())

['Chembur' 'Kurla' 'Malad West' 'Rasayani' 'Vikhroli' 'Neral' 'Mahim'
 'Fort' 'Dombivali' 'Palghar' 'Malad East' 'Vangani' 'Jogeshwari West'
 'Dahisar' 'Borivali East' 'Mulund West' 'Kharghar' 'Vasai'
 'Santacruz East' 'Ambernath East' 'Andheri West' 'Mazagaon' 'Karjat'
 'Khopoli' 'Goregaon East' 'Panvel' 'Kalyan West' 'Andheri East'
 'Dronagiri' 'Umroli' 'Virar' 'Kalyan East' 'Thane West' 'Shahapur'
 'Taloja' 'Ulwe' 'Badlapur East' 'Titwala' 'Diva' 'Kamothe' 'Bhiwandi'
 'Kandivali West' 'Powai' 'Badlapur West' 'Dombivali East'
 'Mira Road East' 'Vasai east' 'Wada' 'Dadar East' 'Colaba' 'Sion'
 'Santosh Nagar' 'Virar East' 'Agripada' 'Gorai' 'Virar West'
 'Santacruz West' 'Kalwa' 'Nala Sopara' 'Hendre Pada' 'Vasai West'
 'Mazgaon' 'Belapur' 'Borivali West' 'Nerul' 'Kumbharkhan Pada'
 'Ghatkopar West' 'Khadawali' 'Mulund East' 'Kalamboli' 'Karanjade'
 'Kanjurmarg' 'Anjurdive' 'Navade' 'Airoli' 'matunga east' 'Vichumbe'
 'Goregaon West' 'Bhangarwadi' 'Bandra West' 'Mandvi' 'Kamathipura'
 'Nalasopara West' 'Bhayandar West' 'Boisar' 'Dharamveer Nagar'
 'Bhayandar East' 'Diva Gaon' 'Parel' 'Sanpada' 'Jogeshwari East'
 'Girgaon' 'Koper Khairane' 'Dombivli (West)' 'Taloje' 'Dundare'
 'Pale Bk.' 'Thakurli' 'Bhandup West' 'Seawoods' 'Vikhroli West'
 'Kandivali East' 'Sewri' 'Ghatkopar East' 'Kanjurmarg East' 'Kurla West'
 'Vevoor' 'Nalasopara East' 'Ville Parle East' 'Mumbai Central' 'Shelu'
 'Palava' 'Byculla' 'New Balaji Nagar' 'Dahisar East' 'Vasind' 'Juhu'
 'Wadala' 'Dahisar West' 'Ambivli' 'Navapada' 'Kurla East'
 'Greater Khanda' 'Ambernath West' 'Dadar West' 'Napeansea Road'
 'Vishnu Nagar' 'Nilje Gaon' 'Vikroli East' 'Prabhadevi' 'Khar West'
 'Masjid Bandar' 'Beturkar Pada' 'Ghodbander' 'Datiwali Gaon' 'Saphale'
 'Bandra East' 'Naigaon West' 'Koproli' 'Shil Phata' 'Cuffe Parade'
 'Lower Parel' 'Vashi' 'Deonar' 'Matunga' 'Ulhasnagar'
 'kasaradavali thane west' 'Peddar Road' 'Naigaon East' 'LBS Marg'
 'Hiranandani Estates' 'Bhandup East' 'Rabale' 'Atgaon' 'Ghansoli' 'Dighe'
 'Worli' 'Kharodi' 'Madanpura' 'Dahisar Navi mumbai' 'Khar'
 'Bandra Kurla Complex' 'Nahur East' 'Usarghar Gaon' 'Kasheli'
 'Thane East' 'Bhuleshwar' 'Sector-20 Koparkhairane']